In [3]:
import pandas as pd
import numpy as np
pd.__version__

'1.5.2'

# 데이터 연산

In [4]:
s1 = pd.Series([1,3,5,7,0], index=[0,1,2,3,4])
s2 = pd.Series([0,2,4,6,8], index=[1,2,3,4,5])
s1 + s2

0     NaN
1     3.0
2     7.0
3    11.0
4     6.0
5     NaN
dtype: float64

In [6]:
s1.add(s2, fill_value=0)

0     1.0
1     3.0
2     7.0
3    11.0
4     6.0
5     8.0
dtype: float64

## add / sub / mul / div / mod / pow

In [30]:
a = np.random.randint(1,10,(3,3))
df = pd.DataFrame(a, columns=list('ADC'))
df

   A  D  C
0  8  5  4
1  3  8  1
2  6  9  2

In [32]:
df + df.iloc[0]

    A   D  C
0  16  10  8
1  11  13  5
2  14  14  6

In [34]:
df - df.iloc[0]

   A  D  C
0  0  0  0
1 -5  3 -3
2 -2  4 -2

In [36]:
df *df.iloc[1]

    A   D  C
0  24  40  4
1   9  64  1
2  18  72  2

In [38]:
df / df.iloc[0] # div

       A    D     C
0  1.000  1.0  1.00
1  0.375  1.6  0.25
2  0.750  1.8  0.50

In [40]:
df % df.iloc[0] # mod

   A  D  C
0  0  0  0
1  3  3  1
2  6  4  2

In [41]:
df ** df.iloc[0]

          A      D    C
0  16777216   3125  256
1      6561  32768    1
2   1679616  59049   16

## 정렬

In [42]:
s = pd.Series(range(5), index=list("EDCBA"))
s

E    0
D    1
C    2
B    3
A    4
dtype: int64

In [43]:
s.sort_index()

A    4
B    3
C    2
D    1
E    0
dtype: int64

In [44]:
s.sort_values()

E    0
D    1
C    2
B    3
A    4
dtype: int64

In [45]:
df = pd.DataFrame(np.random.randint(0,10,(4,4)),
                 columns=list('BDAC'),
                 index = [2,4,1,3])
df

   B  D  A  C
2  4  2  7  3
4  2  8  8  4
1  3  9  4  0
3  5  1  9  8

In [46]:
df.sort_index()

   B  D  A  C
1  3  9  4  0
2  4  2  7  3
3  5  1  9  8
4  2  8  8  4

In [47]:
df.sort_values(by='B')

   B  D  A  C
4  2  8  8  4
1  3  9  4  0
2  4  2  7  3
3  5  1  9  8

In [49]:
df.sort_values(by=['B','A'])

   B  D  A  C
4  2  8  8  4
1  3  9  4  0
2  4  2  7  3
3  5  1  9  8

In [51]:
df.sort_index(axis=1)

   A  B  C  D
2  7  4  3  2
4  8  2  4  8
1  4  3  0  9
3  9  5  8  1

In [52]:
df.sort_index(axis=0)

   B  D  A  C
1  3  9  4  0
2  4  2  7  3
3  5  1  9  8
4  2  8  8  4

# 데이터 결합

## concat / append

In [53]:
s1 = pd.Series(['a','b'], index=[1,2])
s2 = pd.Series(['c','d'], index=[3,4])
pd.concat([s1,s2])

1    a
2    b
3    c
4    d
dtype: object

In [60]:
df1 = pd.DataFrame(np.random.randint(0,10,(2,2)), index = [1,2])
df1

   0  1
1  7  7
2  5  3

In [61]:
df2 = pd.DataFrame(np.random.randint(0,10,(2,2)), index = [3,4])
df2

   0  1
3  4  3
4  9  2

In [64]:
pd.concat([df1,df2],axis=0)

   0  1
1  7  7
2  5  3
3  4  3
4  9  2

In [63]:
pd.concat([df1,df2], axis=1)

     0    1    0    1
1  7.0  7.0  NaN  NaN
2  5.0  3.0  NaN  NaN
3  NaN  NaN  4.0  3.0
4  NaN  NaN  9.0  2.0

In [65]:
df1.append(df2)

C:\Users\chosun\AppData\Local\Temp\ipykernel_16052\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

   0  1
1  7  7
2  5  3
3  4  3
4  9  2

## 병합과 조인

In [66]:
df1 = pd.DataFrame({"학생" : ['홍길동','이순신','임꺽정','김유신'],
                   "학과" : ["경영학과","교육학과","컴퓨터학과","통계학과"]})
df1

    학생     학과
0  홍길동   경영학과
1  이순신   교육학과
2  임꺽정  컴퓨터학과
3  김유신   통계학과

In [67]:
df2 = pd.DataFrame({"학생" : ['홍길동','이순신','임꺽정','김유신'],
                   "입학년도" : [2012,2014,2016,2018]})
df2

    학생  입학년도
0  홍길동  2012
1  이순신  2014
2  임꺽정  2016
3  김유신  2018

In [71]:
df3 = df1.merge(df2)
df3

    학생     학과  입학년도
0  홍길동   경영학과  2012
1  이순신   교육학과  2014
2  임꺽정  컴퓨터학과  2016
3  김유신   통계학과  2018

In [72]:
df4 = pd.DataFrame({"학과" : ["경영학과","교육학과","컴퓨터학과","통계학과"],
                   "학과장" : ["황희","장영실","안창호","정약용"]})
df4

      학과  학과장
0   경영학과   황희
1   교육학과  장영실
2  컴퓨터학과  안창호
3   통계학과  정약용

In [73]:
pd.merge(df3,df4)

    학생     학과  입학년도  학과장
0  홍길동   경영학과  2012   황희
1  이순신   교육학과  2014  장영실
2  임꺽정  컴퓨터학과  2016  안창호
3  김유신   통계학과  2018  정약용

In [87]:
df5 = pd.DataFrame({"학과" : ['경영학과','교육학과','교육학과','컴퓨터학과','컴퓨터학과','통계학과'],
                   "과목" : ['경영개론','기초수학','물리학','프로그래밍','운영체제','확률론'] })
df5

      학과     과목
0   경영학과   경영개론
1   교육학과   기초수학
2   교육학과    물리학
3  컴퓨터학과  프로그래밍
4  컴퓨터학과   운영체제
5   통계학과    확률론

In [88]:
df1.merge(df5)

    학생     학과     과목
0  홍길동   경영학과   경영개론
1  이순신   교육학과   기초수학
2  이순신   교육학과    물리학
3  임꺽정  컴퓨터학과  프로그래밍
4  임꺽정  컴퓨터학과   운영체제
5  김유신   통계학과    확률론

In [93]:
df1.merge(df5, on = "학과")  # 병합 기준이 학과

    학생     학과     과목
0  홍길동   경영학과   경영개론
1  이순신   교육학과   기초수학
2  이순신   교육학과    물리학
3  임꺽정  컴퓨터학과  프로그래밍
4  임꺽정  컴퓨터학과   운영체제
5  김유신   통계학과    확률론

In [94]:
df6 = pd.DataFrame({"이름" : ['홍길동', '이순신','임꺽정','김유신'],
                   '성적' : ['A','B+','A+','B']})
df6

    이름  성적
0  홍길동   A
1  이순신  B+
2  임꺽정  A+
3  김유신   B

In [102]:
pd.merge(df1,df6, left_on="학생",right_on="이름" )

    학생     학과   이름  성적
0  홍길동   경영학과  홍길동   A
1  이순신   교육학과  이순신  B+
2  임꺽정  컴퓨터학과  임꺽정  A+
3  김유신   통계학과  김유신   B

In [103]:
pd.merge(df1,df6, left_on="학생",right_on="이름").drop("이름",axis=1)

    학생     학과  성적
0  홍길동   경영학과   A
1  이순신   교육학과  B+
2  임꺽정  컴퓨터학과  A+
3  김유신   통계학과   B

In [111]:
mdf1 = df1.set_index("학생")
mdf1

        학과
학생
홍길동   경영학과
이순신   교육학과
임꺽정  컴퓨터학과
김유신   통계학과

In [112]:
mdf2 = df2.set_index("학생")
mdf2

     입학년도
학생
홍길동  2012
이순신  2014
임꺽정  2016
김유신  2018

In [119]:
pd.merge(mdf1,mdf2, left_index=True,right_index=True)

        학과  입학년도
학생
홍길동   경영학과  2012
이순신   교육학과  2014
임꺽정  컴퓨터학과  2016
김유신   통계학과  2018

In [116]:
mdf1.join(mdf2)

        학과  입학년도
학생
홍길동   경영학과  2012
이순신   교육학과  2014
임꺽정  컴퓨터학과  2016
김유신   통계학과  2018

In [117]:
pd.merge(mdf1,df6, left_index=True, right_on="이름")

      학과   이름  성적
0   경영학과  홍길동   A
1   교육학과  이순신  B+
2  컴퓨터학과  임꺽정  A+
3   통계학과  김유신   B

In [120]:
df7 = pd.DataFrame({'이름' : ['홍길동','이순신','임꺽정'],
                   '주문음식' : ['햄버거','피자','짜장면']})
df7

    이름 주문음식
0  홍길동  햄버거
1  이순신   피자
2  임꺽정  짜장면

In [121]:
df8 = pd.DataFrame({'이름' : ['홍길동','이순신','김유신'],
                   '주문음료' : ['콜라','사이다','커피']})
df8

    이름 주문음료
0  홍길동   콜라
1  이순신  사이다
2  김유신   커피

In [122]:
pd.merge(df7,df8)

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다

In [125]:
pd.merge(df7,df8,how="outer")

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  임꺽정  짜장면  NaN
3  김유신  NaN   커피

In [126]:
pd.merge(df7,df8,how="left")

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  임꺽정  짜장면  NaN

In [128]:
pd.merge(df7,df8,how="right")

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  김유신  NaN   커피

In [132]:
df9 = pd.DataFrame({'이름' : ['홍길동','이순신','임꺽정','김유신'],
                   '순위' : [3,2,4,1]})
df9

    이름  순위
0  홍길동   3
1  이순신   2
2  임꺽정   4
3  김유신   1

In [133]:
df10 = pd.DataFrame({'이름' : ['홍길동','이순신','임꺽정','김유신'],
                   '순위' : [4,1,3,2]})
df10

    이름  순위
0  홍길동   4
1  이순신   1
2  임꺽정   3
3  김유신   2

In [134]:
pd.merge(df9,df10,on="이름")

    이름  순위_x  순위_y
0  홍길동     3     4
1  이순신     2     1
2  임꺽정     4     3
3  김유신     1     2

In [135]:
pd.merge(df9,df10,on="이름",suffixes=["_인기","_성적"])

    이름  순위_인기  순위_성적
0  홍길동      3      4
1  이순신      2      1
2  임꺽정      4      3
3  김유신      1      2